In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('athlete_events.csv')
data.head().T

,0,1,2,3,4
ID,1,2,3,4,5
Name,A Dijiang,A Lamusi,Gunnar Nielsen Aaby,Edgar Lindenau Aabye,Christine Jacoba Aaftink
Sex,M,M,M,M,F
Age,24,23,24,34,21
Height,180,170,NaN,NaN,185
Weight,80,60,NaN,NaN,82
Team,China,China,Denmark,Denmark/Sweden,Netherlands
NOC,CHN,CHN,DEN,DEN,NED
Games,1992 Summer,2012 Summer,1920 Summer,1900 Summer,1988 Winter
Year,1992,2012,1920,1900,1988
Season,Summer,Summer,Summer,Summer,Winter
City,Barcelona,London,Antwerpen,Paris,Calgary
Sport,Basketball,Judo,Football,Tug-Of-War,Speed Skating
Event,Basketball Men's Basketball,Judo Men's Extra-Lightweight,Football Men's Football,Tug-Of-War Men's Tug-Of-War,Speed Skating Women's 500 metres
Medal,NaN,NaN,NaN,Gold,NaN

1.How old were the youngest male and female participants of the 1992 Olympics?

In [3]:
print(data.loc[(data['Sex'] == 'M') & (data['Year'] == 1992), 'Age'].min())
print(data.loc[(data['Sex'] == 'F') & (data['Year'] == 1992), 'Age'].min())

11.0
12.0

 2.What was the percentage of male basketball players among all the male participants of the 2012 Olympics? Round the answer to the first decimal.

In [4]:
male_basketball_2012 = data.loc[(data['Sport'] == 'Basketball') & (data['Year'] == 2012) 
                                & (data['Sex'] == 'M'), 'ID'].shape[0]
male_2012 = data.loc[(data['Year'] == 2012) & (data['Sex'] == 'M'), 'ID'].shape[0]
print(male_basketball_2012/male_2012)

0.020267417311752287


3.What are the mean and standard deviation of height for female tennis players who participated in the 2000 Olympics? Round the answer to the first decimal.

In [5]:
female_tennis_2000 = data.loc[(data['Sport'] == 'Tennis') & (data['Year'] == 2000) & (data['Sex'] == 'F'), 'Height']
print(female_tennis_2000.mean())
print(female_tennis_2000.std())

171.792
6.4586725890776675

4.Find a sportsman who participated in the 2006 Olympics, with the highest weight among other participants of the same Olympics. What sport did he or she do?

In [6]:
max_weight_2006 = data.loc[(data['Year'] == 2006), 'Weight'].max()
sport = data.loc[(data['Weight'] == max_weight_2006) & (data['Year'] == 2006), ['Sport', 'Weight', 'Year']]
sport

         Sport  Weight  Year
8102  Skeleton   127.0  2006

5.How many times did John Aalberg participate in the Olympics held in different years?

In [7]:
Aalberg = data.loc[(data['Name'].isin(['John Aalberg'])), 'Year']
Aalberg.nunique()

2

6.How many gold medals in tennis did sportspeople from the Switzerland team win at the 2008 Olympics? Count every medal from every sportsperson.

In [8]:
gold_medal_2008_Sw = data.loc[(data['Team'] == 'Switzerland') & (data['Year'] == 2008) & (data['Medal'] == 'Gold'), ['ID', 'Name']]
gold_medal_2008_Sw.shape[0]

3

7.Is it true that Spain won fewer medals than Italy at the 2016 Olympics? Do not consider NaN values in Medal column.

In [9]:
medal_2016_Spain = data.loc[(data['Team'] == 'Spain') & (data['Year'] == 2016) & (pd.notna(data['Medal'])), 'ID']
medal_2016_Italy = data.loc[(data['Team'] == 'Italy') & (data['Year'] == 2016) & (pd.notna(data['Medal'])), 'ID']
print('Spain {0} and Italy {1}'.format(medal_2016_Spain.shape[0], medal_2016_Italy.shape[0]))

Spain 43 and Italy 70

8.What age category did the fewest and the most participants of the 2008 Olympics belong to?

In [10]:
bins=[15,25,35,45,55,65]
data_2008_all = data[data['Year'] == 2008]
print(pd.cut(data_2008_all['Age'], bins).value_counts())

(15, 25]    7275
(25, 35]    5504
(35, 45]     623
(45, 55]      91
(55, 65]      11
Name: Age, dtype: int64

9.Is it true that there were Summer Olympics held in Atlanta? Is it true that there were Winter Olympics held in Squaw Valley?

In [11]:
data.loc[(data['City'].isin(['Atlanta', 'Squaw Valley'])), ['City', 'Season']].drop_duplicates()

            City  Season
32       Atlanta  Summer
83  Squaw Valley  Winter

10.What is the absolute difference between the number of unique sports at the 1986 Olympics and 2002 Olympics?

In [12]:
array = ['1986', '2002']
data_1986_2002 = data.loc[data['Year'].isin(array)]
pd.crosstab(data_1986_2002['Sport'], data_1986_2002['Year']).count()

Year
2002    15
dtype: int64